In [3]:
# creating dataFrame

In [9]:
import pandas as pd

In [11]:
data = [['shubham',24],['harry',26],['rohan',19],['jay',23]]

In [13]:
data

[['shubham', 24], ['harry', 26], ['rohan', 19], ['jay', 23]]

In [15]:
pd.DataFrame(data, columns=["Name","Marks"])

      Name  Marks
0  shubham     24
1    harry     26
2    rohan     19
3      jay     23

In [17]:
data = {"a": [1,3,5], "b":[52,56,96]}

In [19]:
data

{'a': [1, 3, 5], 'b': [52, 56, 96]}

In [23]:
df = pd.DataFrame(data)

In [25]:
df

   a   b
0  1  52
1  3  56
2  5  96

In [29]:
import numpy as np
arr = np.array([[5,6],[8,9]])

In [31]:
arr

array([[5, 6],
       [8, 9]])

In [35]:
df = pd.DataFrame(arr, columns=["math","eng"],index=["shubham","jay"])
df

         math  eng
shubham     5    6
jay         8    9

In [47]:
df = pd.read_excel("data.xlsx")

In [49]:
df

      Name  Marks
0  Shubham     19
1      Ram     20
2   Sameer     10
3   Sachin     15
4    Virat     20
5    Vijay     10

In [53]:
df = pd.read_csv("data.csv")
df

      Name  Marks
0  Shubham     19
1      Ram     20
2   Sameer     10
3   Sachin     15
4    Virat     20
5    Vijay     10

In [66]:
pd.read_json("data.json")

      name     lang
0  shubham  marathi
1    harry      eng

In [68]:
df = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")

In [70]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [72]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [74]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [78]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [80]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [82]:
df.shape

(244, 7)